# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.3'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nvm' # Node manager
brew 'php-cs-fixer'
brew 'redis'

# Apps
cask 'aerial'
cask 'dashlane'
cask 'discord'
cask 'firefox'
cask 'github', args: { appdir: "/Applications/Development" }
cask 'google-chrome'
cask 'iterm2', args: { appdir: "/Applications/Development" }
cask 'java'
cask 'moom'
cask 'phpstorm', args: { appdir: "/Applications/Development" }
cask 'scroll-reverser'
cask 'slack'
cask 'sourcetree', args: { appdir: "/Applications/Development" }
cask 'spotify'
cask 'tableplus', args: { appdir: "/Applications/Development" }
cask 'the-unarchiver'
cask 'tinkerwell', args: { appdir: "/Applications/Development" }
cask 'zoomus'

# Fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'myTuner Radio Live FM Stations', id: 881415018
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Todoist: To-Do List & Tasks', id: 585829637