# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'wget'
brew 'zlib' # Needed for Memcached
brew 'zsh-autosuggestions'

# Image Packages
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.1'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'mysql', start_service: true
brew 'nvm' # Node manager
brew 'php-cs-fixer'
brew 'redis', start_service: true

# Apps
cask 'aerial'
cask 'discord'
cask 'firefox'
cask 'github', args: { appdir: "/Applications/Development" }
cask 'google-chrome'
cask 'iterm2', args: { appdir: "/Applications/Development" }
# cask 'java'
cask 'moom'
cask 'phpstorm', args: { appdir: "/Applications/Development" }
cask 'scroll-reverser'
cask 'slack'
cask 'sourcetree', args: { appdir: "/Applications/Development" }
cask 'spotify'
cask 'tableplus', args: { appdir: "/Applications/Development" }
cask 'the-unarchiver'
cask 'tinkerwell', args: { appdir: "/Applications/Development" }
cask 'zoom'

# Fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
# cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Gapplin', id: 768053424
mas 'iHeartRadio', id: 999997712
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator Pro', id: 1289583905
mas 'Telegram', id: 747648890
mas 'Todoist', id: 585829637
